tutorials/pimpleHFDIBFoam/Immersed_Cyl_Static/Cyl_Body_Fitted_New/Embedded_Cyl_Re_20_2D-Mesh20000/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 5e-02;   // Re=20 with U=1 and D=1
rho             rho [1 -3 0 0 0 0 0] 1000;
// ************************************************************************* //
