tutorials/pimpleHFDIBFoam/Immersed_Cyl_Static/Cyl_Body_Fitted_New/Embedded_Cyl_Re_20_2D-Mesh20000/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // Euler is fine; backward is 2nd order (try after stable run)
    // default         Euler;
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default                             none;

    div(phi,U)                          Gauss linearUpwind grad(U);
    div(phi,p)                          Gauss upwind;

    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}


laplacianSchemes
{
    // Your mesh is not perfectly orthogonal -> use corrected
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
